; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 604398 1 3 4 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared1 - mode
	thermograph0 - mode
	infrared3 - mode
	image2 - mode
	Star0 - direction
	Star3 - direction
	Star2 - direction
	GroundStation4 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Star6 image2)
	(have_image Planet7 infrared3)
	(have_image Planet8 image2)
	(have_image Planet9 infrared1)
	(have_image Planet10 image2)
	(have_image Star11 thermograph0)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite0 star6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
5. (turn_to satellite0 planet7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet7)
   goals met: 0 of 6
6. (take_image satellite0 planet7 instrument2 infrared3)
   added: (have_image planet7 infrared3)
   goals met: 1 of 6
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 6
8. (turn_to satellite0 star6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star6)
   goals met: 1 of 6
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
10. (turn_to satellite0 groundstation4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 6
11. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 1 of 6
12. (turn_to satellite0 star6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star6)
   goals met: 1 of 6
13. (take_image satellite0 star6 instrument1 image2)
   added: (have_image star6 image2)
   goals met: 2 of 6
14. (turn_to satellite0 star3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star3)
   goals met: 2 of 6
15. (turn_to satellite0 star11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star11)
   goals met: 2 of 6
16. (take_image satellite0 star11 instrument1 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 3 of 6
17. (turn_to satellite0 star3 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star3)
   goals met: 3 of 6
18. (turn_to satellite0 planet8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet8)
   goals met: 3 of 6
19. (take_image satellite0 planet8 instrument1 image2)
   added: (have_image planet8 image2)
   goals met: 4 of 6
20. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 4 of 6
21. (turn_to satellite0 planet10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet10)
   goals met: 4 of 6
22. (take_image satellite0 planet10 instrument1 image2)
   added: (have_image planet10 image2)
   goals met: 5 of 6
23. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 6
24. (turn_to satellite0 star3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star3)
   goals met: 5 of 6
25. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 6
26. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 5 of 6
27. (turn_to satellite0 planet9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet9)
   goals met: 5 of 6
28. (take_image satellite0 planet9 instrument0 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 6 of 6
